____
# Practice

### 1. 1 Что такое Java, откуда она взялась и зачем нужна

_Что означает декларируемый Java принцип "Write once, run anywhere"?_

 - Java-программа может быть скомпилирована в исполняемый файл под любую платформу.
 - Скомпилированная Java-программа может быть запущена на любой платформе, где есть JVM.
 - Java-программа может быть запущена из исходников на любой платформе, где есть интерпретатор Java.

_Как называется двоичный формат, который понимает виртуальная машина Java?_

 - Bytecode (байткод)
 - ~~Virtual code (виртуальный код)~~
 - ~~Abstract syntax tree (абстрактное синтаксическое дерево)~~
 - ~~Intermediate language (промежуточный язык)~~
____
### 1. 2 Первый контакт — Hello World

_Выберите правильные объявления метода main — такие, при которых программа успешно скомпилируется и запустится._

 - ~~static void main(String[] args)~~
 - ~~public static void main()~~
 - ~~public void main(String[] args)~~
 - ~~public static int main(String[] args)~~
 - public static void main(String[] args)

_Что произойдет, если объявить метод main с синтаксически корректной, но не поддерживаемой JVM комбинацией модификаторов, возвращаемого значения и параметров?_

 - ~~Программа скомпилируется, запустится, но ничего не сделает.~~
 - ~~Программа не скомпилируется.~~
 - Программа скомпилируется, но при попытке запуска упадет с ошибкой.

_Предположим, вы написали программу, состоящую из двух классов, и в каждом классе объявили точку входа — метод main. Что из этого выйдет?_

 - ~~Программа не скомпилируется~~
 - ~~Программа скомпилируется, но не запустится~~
 - Программа скомпилируется и запустится. Неоднозначности не возникнет, поскольку при запуске всегда явно указывается класс, в котором JVM должна искать метод main (+)

_Выберите верные утверждения про формат JAR. Может быть выбрано несколько пунктов._

 - Формат JAR основан на формате ZIP.
 - В JAR-архиве может быть специальный файл с метаданными — META-INF/MANIFEST.MF.
 - ~~В JAR-файл разрешено запаковывать только class-файлы.~~
 - ~~Формат JAR основан на формате RAR.~~

_Сопоставьте следующие аббревиатуры с их определениями._

 - JDK - Набор инструментов для разработки Java-программ, включая компилятор
 - JRE - Набор инструментов для запуска Java-программ, включая виртуальную машину
 - JVM - Виртуальная машина Java
 - JIT - Подход к реализации виртуальной машины, при котором байткод не интерпретируется, а компилируется в машинный код для исполнения аппаратным процессором
 - JAR - Формат архива, в который обычно упаковывают Java-программы и библиотеки

_Напишите программу, выводящую в консоль It's alive! It's alive!_

```Java
    public class Main{
        public static void main(String[] args){
            System.out.println("It's alive! It's alive!");
        }
    }
```
____
### 1. 3 Знакомство со средой разработки

_Выберите из приведенных ниже комментариев те, которые являются JavaDoc-комментариями._

 - ~~/// Is this a javadoc?~~
 - ~~/*! Is this a javadoc? */~~
 - ~~/* Is this a javadoc? */~~
 - /** Is this a javadoc? */ 

_Чтобы убедиться, что вы действительно научились пользоваться компилятором и запускать Java-программы, запустите следующую программу. В качестве ответа введите то, что эта программа напечатает в консоль._


```Java
    import java.security.MessageDigest;
    public class Quiz {
        public static void main(String[] args) throws Exception {
            MessageDigest md = MessageDigest.getInstance("MD5");
            byte[] digest = md.digest("abracadabra".getBytes("UTF-8"));
            for (byte b : digest) {
                System.out.printf("%02x", b);
            }
        }
    }
```

 - ec5287c45f0e70ec22d52e8bcbeeb640

_Скачайте игру Sokobano, написанную на Java. Ваша задача — определить имя главного класса игры. Того, который содержит метод main и запускает игру. Введите имя этого класса ниже. Имя класса можно вводить как с пакетом, так и без.
К решению можно подойти двумя путями: искать по исходникам метод main или внимательно рассмотреть команду запуска программы, зашитую в .bat/.sh файлах.
А когда справитесь с этим заданием, можете поздравить себя с окончанием первого модуля и немного поиграть :)_

 - Application
 ____
 
