package ru.geekbrains.lesson1;

public class Main {
    public static void main(String[] args) {

        // 1. Создать переменные всех пройденных типов данных, и инициализировать их значения;

        // Примитивные.
        byte value1 = 127;
        short value2 = 32767;
        int value3 = 2147483647;
        long value4 = 9223372036854775807L;
        float value5 = 44.44F;
        double value6 = 44.44D;
        char value7 = 'C';
        boolean value8 = false;
        // Ссылочные (объектные).
        String text = "Hello, World!";

        ///////////////////////////////////////////////////////////////////////////////////

        /* 3. Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,где a, b, c, d –
        входные параметры этого метода; */

        System.out.println(resultExpression(11, 22, 33, 44) + "\n");

        ///////////////////////////////////////////////////////////////////////////////////

        /* 4. Написать метод, принимающий на вход два числа, и проверяющий что их сумма лежит в пределах
        от 10 до 20(включительно), если да – вернуть true, в противном случае – false */

        System.out.println(expressionCheck(11, 19) + "\n");

        ///////////////////////////////////////////////////////////////////////////////////

        /* 5. Написать метод, которому в качестве параметра передается целое число, метод должен напечатать
        в консоль положительное ли число передали, или отрицательное;
        Замечание: ноль считаем положительным числом. */

        checkPositiveNegative(22);

        ///////////////////////////////////////////////////////////////////////////////////

        /* 6. Написать метод, которому в качестве параметра передается целое число, метод должен вернуть
        true, если число отрицательное; */

        System.out.println(checkNegative(-2) + "\n");

        ///////////////////////////////////////////////////////////////////////////////////

        /* 7. Написать метод, которому в качестве параметра передается строка, обозначающая имя, метод
        должен вывести в консоль сообщение «Привет, указанное_имя!»; */

        printHello("Nika");

        ///////////////////////////////////////////////////////////////////////////////////

        /* 8. * Написать метод, который определяет является ли год високосным, и выводит сообщение в консоль.
        Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный. */

        System.out.println(checkLeapYear(2000));

        ///////////////////////////////////////////////////////////////////////////////////
    }

    public static float resultExpression(float a, float b, float c, float d) {
        return a * (b + (c / d));
    }

    public static boolean expressionCheck(int a, int b) {
        return a >= 10 && b <= 20;
    }

    public static void checkPositiveNegative(int a) {
        System.out.println(a >= 0 ? "Positive\n" : "Negative\n");
    }

    public static boolean checkNegative(int a) {
        return a < 0;
    }

    public static void printHello(String name) {
        System.out.println("Hello, " + name + "\n");
    }

    public static boolean checkLeapYear(int year) {
        if (year % 400 == 0) {
            return true;
        } else if (year % 100 == 0) {
            return false;
        } else {
            return year % 4 == 0;
        }
    }
}
