package org.stepik.week4;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_4_3_6 {
    /*
     * Вопрос: Почему рекомендуется выводить отладочную информацию при помощи
     * класса Logger, а не через System.out или System.err?
     *
     *
     * Ответ:
     * 1) Logger дает возможность гибко настраивать формат и место записи сообщений без изменения программы.
     * 2) Logger поддерживает локализацию отладочных сообщений.
     * 3) Logger позволяет менять детальность логирования, не прибегая к if'ам в коде.
     *
     */
}
