package org.stepik.week5;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_5_1_8 {
    /*
     * Вопрос: В чем отличия java.io.File и java.nio.file.Path?
     *
     *
     * Ответ:
     * 1) Path допускает работу с файлами на виртуальных файловых системах, а File нет.
     * 2) Методы работы с ФС через объект Path при ошибках ввода-вывода бросают исключения;
     *    методы работы с File при ошибках возвращают false.
     * 3) File — это старый способ доступа к файловой системе, Path — это новый рекомендуемый способ.
     * 4) File — это класс, Path — это интерфейс.
     *
     */
}
