package org.stepik.week5;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_5_3_13 {
    /*
     * Вопрос: Напишите программу, читающую текст из System.in и выводящую в
     * System.out сумму всех встреченных в тексте вещественных чисел с точностью
     * до шестого знака после запятой. Числом считается последовательность символов,
     * отделенная от окружающего текста пробелами или переводами строк и успешно
     * разбираемая методом Double.parseDouble.
     *
     * На этот раз вам надо написать программу полностью, т.е. объявить класс (с именем
     * Main — таково ограничение проверяющей системы), метод main, прописать все import'ы.
     *
     *
     * Ответ: см. ниже, с 19 по 39 без //.
     *
     */

//    import java.io.*;
//    import java.util.Locale;
//    import java.util.Scanner;
//
//    public class Main {
//        public static void main(String[] args) throws IOException {
//            Scanner scanner = new Scanner(System.in);
//            scanner.useLocale(Locale.ENGLISH);
//            double d;
//            double sum = 0.0;
//            while (scanner.hasNext()) {
//                if (scanner.hasNextDouble()) {
//                    d = scanner.nextDouble();
//                    sum += d;
//                } else {
//                    scanner.next();
//                }
//            }
//            System.out.printf(Locale.ENGLISH, "%.6f", sum);
//        }
//    }
}
