package org.stepik.week1;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_1_2_14 {
/*
    *
    *Напишите программу, выводящую в консоль It's alive! It's alive!
    *Класс должен называться "Main", это ограничение проверяющей системы.
    *
    * Ответ:
      public class Main {
	    public static void main(String[] args) {
		    System.out.println("It's alive! It's alive!");
	    }
      }
    */
}
