package org.stepik.week1;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_1_3_9 {
    /*
     *
     *Вопрос: Скачайте игру Sokobano, написанную на Java. Ваша задача — определить имя
     * главного класса игры. Того, который содержит метод main и запускает игру. Введите
     * имя этого класса ниже. Имя класса можно вводить как с пакетом, так и без.
     *
     * К решению можно подойти двумя путями: искать по исходникам метод main или внимательно
     * рассмотреть команду запуска программы, зашитую в .bat/.sh файлах.
     *
     *А когда справитесь с этим заданием, можете поздравить себя с окончанием первого модуля и немного поиграть :)
     *
     *
     *Ответ: gdi1sokoban.Application
     */
}
