package org.stepik.week1;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_1_2_13 {
    /*
     *Вопрос: Сопоставьте следующие аббревиатуры с их определениями.
     *
     *Ответ:
     *  JDK - Набор инструментов для разработки Java-программ, включая компилятор;
     *  JRE - Набор инструментов для запуска Java-программ, включая виртуальную машину;
     *  JVM - Виртуальная машина Java;
     *  JIT - Подход к реализации виртуальной машины, при котором байткод не интерпретируется,
     *        а компилируется в машинный код для исполнения аппаратным процессором;
     *  JAR - Формат архива, в который обычно упаковывают Java-программы и библиотеки;
     * */
}
