package org.stepik.week6;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_6_2_10 {
    /*
     * Вопрос: Чем коллекции отличаются от массивов?
     *
     *
     * Ответ:
     * 1) Коллекции могут динамически менять размер, а размер массива фиксируется при создании.
     * 2) Массивы встроены в язык, а коллекции — обычные классы стандартной библиотеки.
     * 3) Коллекции можно сравнивать по содержимому обычным методом equals(), а для сравнения
     *    массивов используется внешний утилитный метод Arrays.equals().
     * 4) Коллекции могут содержать только объекты, а массивы могут содержать и примитивы.
     *
     */
}
