package org.stepik.week6;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_6_1_10 {
    /*
     * Вопрос:
     *
     * Предположим, у нас есть параметризованный класс
     *
     * public class Example<X> {
     *     ...
     * }
     *
     * Что можно подставлять в качестве значения параметра X при использовании этого класса в программе?

     *
     *
     * Ответ:
     * 1) имя любого интерфейса (например, CharSequence)
     * 2) имя любого класса (например, Object)
     * 3) символ "?" или более сложное выражение с ключевыми словами extends и super
     * 4) значение X можно не указывать, т.е. использовать класс Example как обычный непараметризованный
     * 5) имя любого перечисления (например, DayOfWeek)
     *
     */
}
