package org.stepik.week6;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_6_3_7 {
    /*
     * Вопрос: Каким образом можно получить экземпляр функционального интерфейса?
     *
     *
     * Ответ:
     * 1) использовать ссылку на статический метод.
     * 2) использовать ссылку на нестатический метод.
     * 3) использовать лямбда-выражение.
     * 4) объявить анонимный класс, реализующий интерфейс, и создать экземпляр этого класса.
     * 5) использовать ссылку на конструктор.
     * 6) объявить именованный класс, реализующий интерфейс, и создать экземпляр этого класса.
     *
     */
}
