package org.stepik.week6;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_6_3_6 {
    /*
     * Вопрос: Найдите в пакете java.util.function интерфейс, чей абстрактный
     * метод принимает два параметра — объект и примитивный double — и ничего не возвращает.
     *
     * В качестве ответа введите имя этого функционального интерфейса с пакетом или без.
     * Угловые скобки с именами generic-параметров вводить не нужно.
     *
     *
     * Ответ: ObjDoubleConsumer
     *
     */
}
