package org.stepik.week3;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_3_4_3 {
    /*
     * Вопрос: Выберите условия, необходимые для того, чтобы метод производного класса
     * переопределил метод базового класса.
     *
     * Это сложный вопрос. Если правильный ответ никак не находится, попробуйте экспериментально
     * проверить все эти условия на каком-нибудь синтетическом примере. Факт успешного
     * переопределения метода поможет подтвердить аннотация @Override.
     *
     *
     * Ответ:
     * 1) Метод базового класса должен быть виден в производном классе.
     * 2) Метод производного класса должен иметь в точности тот же набор параметров,
     *    что и метод базового класса.
     * 3) Тип, возвращаемый методом производного класса, должен совпадать или быть
     *    подклассом типа, возвращаемого методом базового класса.
     * 4) Метод производного класса должен иметь модификатор доступа, такой же или
     *    более открытый, чем метод базового      *  класса.
     */
}
