package org.stepik.week3;

/**
 * @author Nika Zurbaevi
 */
public class QuestionAnswer_3_1_10 {
    /*
     * Вопрос: Сопоставьте следующие понятия ООП с их определениями.
     *
     * Ответ:
     * Абстракция - Выделение важных сущностей и свойств реального мира для их моделирования в программе.
     * Инкапсуляция - Объединение внутри класса данных и операций с ними; защита данных и других деталей
     * реализации от прямого доступа.
     * Наследование - Возможность создания производных классов на основе существующих.
     * Полиморфизм - Возможность использования производного класса там, где разрешен экземпляр базового класса;
     * при этом вызываются методы, переопределенные в производном классе.
     *
     */
}
